tutorials/floatRigidBody/floatRigidBody_monolithic/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.25;
maxDeltaT       0.002;

functions
{
    sixDoF_History
    {
        type           sixDoFRigidBodyStateFvBeam;
        libs           ("libsixDoFRigidBodyStateFvBeam.so");
        angleFormat    radians;
        writeControl   runTime;
        writeInterval  0.01;
    }
    
    interfaceHeight1
    {
     	type            interfaceHeight;
	libs            ("libfieldFunctionObjects.so");
	locations       ((0.25 0.025 0) (0.75 0.025 0));
        alpha           alpha.water;
        writeControl   runTime;
	writeInterval  0.01;
    }

    // Mooring line (beam region beamone) history, every time step, in
    // postProcessing/0/. Patch left is the anchor, right the attachment to
    // the box. Q and M are the end force and moment vectors (averaged over
    // the end face): |Q| is axial plus shear, so the line tension is in
    // axialForcebeamone.dat (written by the finiteVolumeBeam restraint)

    // beamForcesMoments_left.dat: time Q_x Q_y Q_z M_x M_y M_z at the anchor
    beamForcesMomentsAnchor
    {
        type            beamForcesMoments;
        libs            ("libwireBunchingModels.so");
        region          beamone;
        historyPatch    left;
    }

    // beamForcesMoments_right.dat: the same at the box
    beamForcesMomentsAttachment
    {
        type            beamForcesMoments;
        libs            ("libwireBunchingModels.so");
        region          beamone;
        historyPatch    right;
    }

    // beamDisplacements_right.dat: displacement W of the box end
    beamDisplacementsAttachment
    {
        type            beamDisplacements;
        libs            ("libwireBunchingModels.so");
        region          beamone;
        historyPatch    right;
    }

    // Beam Newton-Raphson iterations per time step
    beamConvergenceData
    {
        type            beamConvergenceData;
        libs            ("libwireBunchingModels.so");
        region          beamone;
    }
	      

}

// ************************************************************************* //
